Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/edc/PIC32MZ2048EFM100.PIC
      <edc:SFRDef edc:_addr="0x1F8E601C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E6020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00218_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------------nnnnnnn" edc:cname="RNGCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="RNGCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCNT" edc:desc="" edc:mask="0x7f" edc:name="RCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f8f0000" edc:endaddr="0x1f900000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_ssx">
      <edc:AdjustPoint edc:_addr="0x1F8F0000" edc:offset="1296"/>
      <edc:SFRDef edc:_addr="0x1F8F0510" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="1" edc:access="------------------rrrrrrrrrrrrrr" edc:cname="SBFLAG" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="SBFLAG" edc:nzwidth="32" edc:por="------------------00000000000000" ltx:baseofperipheral="SB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T0PGV" edc:desc="" edc:mask="0x1" edc:name="T0PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1PGV" edc:desc="" edc:mask="0x1" edc:name="T1PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2PGV" edc:desc="" edc:mask="0x1" edc:name="T2PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3PGV" edc:desc="" edc:mask="0x1" edc:name="T3PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4PGV" edc:desc="" edc:mask="0x1" edc:name="T4PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5PGV" edc:desc="" edc:mask="0x1" edc:name="T5PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6PGV" edc:desc="" edc:mask="0x1" edc:name="T6PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7PGV" edc:desc="" edc:mask="0x1" edc:name="T7PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8PGV" edc:desc="" edc:mask="0x1" edc:name="T8PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9PGV" edc:desc="" edc:mask="0x1" edc:name="T9PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T10PGV" edc:desc="" edc:mask="0x1" edc:name="T10PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T11PGV" edc:desc="" edc:mask="0x1" edc:name="T11PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T12PGV" edc:desc="" edc:mask="0x1" edc:name="T12PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T13PGV" edc:desc="" edc:mask="0x1" edc:name="T13PGV" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8F0514" edc:offset="31500"/>
      <edc:SFRDef edc:_addr="0x1F8F8020" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="2" edc:access="C---CCCC--------rrrrrrrrrrrr-rrr" edc:cname="SBT0ELOG1" edc:desc="" edc:impl="0x8f00fff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000--------000000000000-000" edc:name="SBT0ELOG1" edc:nzwidth="32" edc:por="0---0000--------000000000000-000" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="" edc:mask="0x7" edc:name="CMD" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="" edc:mask="0xf" edc:name="REGION" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="INITID" edc:desc="" edc:mask="0xff" edc:name="INITID" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CODE" edc:desc="" edc:mask="0xf" edc:name="CODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MULTI" edc:desc="" edc:mask="0x1" edc:name="MULTI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8F8024" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="2" edc:access="------------------------------rr" edc:cname="SBT0ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT0ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8F8028" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="2" edc:access="-------n------------------------" edc:cname="SBT0ECON" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="SBT0ECON" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="ERRP" edc:desc="" edc:mask="0x1" edc:name="ERRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
